# 6.1 Reading and Writing Data in Text Format

In [2]:
import numpy as np
import pandas as pd
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [81]:
!type pydata-book-2nd-edition\examples\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [4]:
df = pd.read_csv('pydata-book-2nd-edition/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('pydata-book-2nd-edition/examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [82]:
!type pydata-book-2nd-edition\examples\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names = ['a', 'b', 'c', 'd', 'message']

In [10]:
pd.read_csv('pydata-book-2nd-edition/examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [83]:
!type pydata-book-2nd-edition\examples\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [12]:
parsed = pd.read_csv('pydata-book-2nd-edition/examples/csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
list(open('pydata-book-2nd-edition/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [14]:
result = pd.read_table('pydata-book-2nd-edition/examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [85]:
!type pydata-book-2nd-edition\examples\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
pd.read_csv('pydata-book-2nd-edition/examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [86]:
!type pydata-book-2nd-edition\examples\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [18]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [20]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [22]:
pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## Reading Text Files in Pieces

In [23]:
pd.options.display.max_rows = 10

In [24]:
result = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [25]:
pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [26]:
chunker = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv', chunksize=1000)
chunker

In [27]:
chunker = pd.read_csv('pydata-book-2nd-edition/examples/ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [28]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

## Writing Data to Text Format

In [29]:
data = pd.read_csv('pydata-book-2nd-edition/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [30]:
data.to_csv('pydata-book-2nd-edition/examples/out.csv')

In [87]:
!type pydata-book-2nd-edition\examples\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [32]:
import sys

In [33]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [34]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [35]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [36]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [37]:
dates = pd.date_range('1/1/2000', periods=7)

In [38]:
ts = pd.Series(np.arange(7), index=dates)

In [39]:
ts.to_csv('pydata-book-2nd-edition/examples/tseries.csv')

In [88]:
!type pydata-book-2nd-edition\examples\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

## Working with Delimited Formats

In [89]:
!type pydata-book-2nd-edition\examples\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [42]:
import csv
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f)

In [43]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [44]:
with open('pydata-book-2nd-edition/examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [45]:
header, values = lines[0], lines[1:]

In [46]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [47]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [48]:
list(zip(*values))

[('1', '1'), ('2', '2'), ('3', '3')]

In [49]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [50]:
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f, dialect=my_dialect)
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [51]:
f = open('pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f, delimiter='|')
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [52]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

## JSON Data

In [53]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [54]:
import json

In [55]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [56]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [57]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [58]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [90]:
!type pydata-book-2nd-edition\examples\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [60]:
data = pd.read_json('pydata-book-2nd-edition/examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [61]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [62]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping

In [63]:
tables = pd.read_html('pydata-book-2nd-edition/examples/fdic_failed_bank_list.html')
len(tables)

1

In [64]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [65]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

## Parsing XML with lxml.objectify

In [66]:
from lxml import objectify

In [67]:
path = 'pydata-book-2nd-edition/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [68]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [69]:
perf = pd.DataFrame(data)

In [70]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [71]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [72]:
root

In [73]:
root.get('href')

'http://www.google.com'

In [74]:
root.text

'Google'

# Question 1

In [75]:
tables = pd.read_html('examples/Food Composition Databases Show Foods List.html')
len(tables)

1

In [76]:
USDA = tables[0]
USDA.head()

,DB,NDB Id,Food Description,Food Group or Manufacturer
0,BF,45059050,"A.A. BORSARI, PEPPER SEASONING PEPPERCORN, UPC...",Valley Brook Farm
1,BF,45058983,"A.A. BORSARI, SAVORY SEASONED SALT, UPC: 81589...",Valley Brook Farm
2,BF,45078606,"AARDVARK HABENERO HOT SAUCE, UPC: 853393000030",Secret Aardvark Trading Company
3,BF,45169417,"A&B AMERICAN STYLE, MORE HEAT SMALL BATCH PEPP...",A & B AMERICAN STYLE LLC
4,BF,45169419,"A&B AMERICAN STYLE, ORGANIC PEPPER SAUCE, UPC:...",A & B AMERICAN STYLE LLC

In [77]:
USDA

,DB,NDB Id,Food Description,Food Group or Manufacturer
0,BF,45059050,"A.A. BORSARI, PEPPER SEASONING PEPPERCORN, UPC...",Valley Brook Farm
1,BF,45058983,"A.A. BORSARI, SAVORY SEASONED SALT, UPC: 81589...",Valley Brook Farm
2,BF,45078606,"AARDVARK HABENERO HOT SAUCE, UPC: 853393000030",Secret Aardvark Trading Company
3,BF,45169417,"A&B AMERICAN STYLE, MORE HEAT SMALL BATCH PEPP...",A & B AMERICAN STYLE LLC
4,BF,45169419,"A&B AMERICAN STYLE, ORGANIC PEPPER SAUCE, UPC:...",A & B AMERICAN STYLE LLC
...,...,...,...,...
20,BF,45091765,"ABC, JELLY SNACK, TARO, UPC: 4711269687135",none
21,BF,45166992,"ABC, PEANUT BUTTER, UPC: 837991219186",none
22,BF,45153753,"ABDALLAH, ALMOND COCONUT CARAMELS, UPC: 766684...","Abdallah, Inc."
23,BF,45145908,"ABDALLAH, ENGLISH TOFFEE, UPC: 766684006027","Abdallah, Inc."
24,BF,45161152,"ABDALLAH, MY SWEET REWARD CARAMEL PATTIES, UPC...","Abdallah, Inc."

In [78]:
Manufacturer_stamps = USDA['Food Group or Manufacturer']
Manufacturer_stamps.value_counts()

none                               4
Ross Products Division             3
Abdallah, Inc.                     3
A & B AMERICAN STYLE LLC           3
Abbyland Foods, Inc.               2
                                  ..
Annabelle Candy Co., Inc.          2
Secret Aardvark Trading Company    1
August Bauer's Sons Inc.           1
Namaste Foods                      1
Bewley Irish Imports               1
Name: Food Group or Manufacturer, Length: 12, dtype: int64

In [84]:
tables = pd.read_html('https://ndb.nal.usda.gov/ndb/search/list')
len(tables)

1

# 6.2 Binary Data Formats

In [2]:
frame = pd.read_csv('pydata-book-2nd-edition/examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
frame.to_pickle('pydata-book-2nd-edition/examples/frame_pickle')

In [4]:
pd.read_pickle('pydata-book-2nd-edition/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## Using HDF5 Format

In [5]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [6]:
store = pd.HDFStore('mydata.h5')

In [7]:
store['obj1'] = frame

In [8]:
store['obj1_col'] = frame['a']

In [17]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [10]:
store['obj1']

           a
0  -0.204708
1   0.478943
2  -0.519439
3  -0.555730
4   1.965781
5   1.393406
6   0.092908
7   0.281746
8   0.769023
9   1.246435
10  1.007189
11 -1.296221
12  0.274992
13  0.228913
14  1.352917
15  0.886429
16 -2.001637
17 -0.371843
18  1.669025
19 -0.438570
20 -0.539741
21  0.476985
22  3.248944
23 -1.021228
24 -0.577087
25  0.124121
26  0.302614
27  0.523772
28  0.000940
29  1.343810
..       ...
70 -1.332610
71  1.074623
72  0.723642
73  0.690002
74  1.001543
75 -0.503087
76 -0.622274
77 -0.921169
78 -0.726213
79  0.222896
80  0.051316
81 -1.157719
82  0.816707
83  0.433610
84  1.010737
85  1.824875
86 -0.997518
87  0.850591
88 -0.131578
89  0.912414
90  0.188211
91  2.169461
92 -0.114928
93  2.003697
94  0.029610
95  0.795253
96  0.118110
97 -0.748532
98  0.584970
99  0.152677

[100 rows x 1 columns]

In [11]:
store.put('obj2', frame, format='table')

In [12]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.007189
11 -1.296221
12  0.274992
13  0.228913
14  1.352917
15  0.886429

In [13]:
store.close()

In [14]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [15]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.204708
1  0.478943
2 -0.519439
3 -0.555730
4  1.965781

## Reading Microsoft Excel Files

In [18]:
xlsx = pd.ExcelFile('pydata-book-2nd-edition/examples/ex1.xlsx')

In [19]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
frame = pd.read_excel('pydata-book-2nd-edition/examples/ex1.xlsx', 'Sheet1')

In [22]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [23]:
writer = pd.ExcelWriter('pydata-book-2nd-edition/examples/ex2.xlsx')

In [24]:
frame.to_excel(writer, 'Sheet1')

In [25]:
writer.save()

In [26]:
frame.to_excel('pydata-book-2nd-edition/examples/ex2.xlsx')

# 6.3 Interacting with Web APIs

In [9]:
import requests

In [10]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [11]:
resp = requests.get(url)

In [12]:
resp

In [13]:
data = resp.json()

In [14]:
data[0]['title']

'Adding native support to query azure data explorer'

In [15]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])

In [16]:
issues

,number,title,labels,state
0,24818,Adding native support to query azure data expl...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
1,24817,SparseDataFrame.to_coo does not convert the de...,[],open
2,24816,Question regarding Series.argsort documentation,[],open
3,24815,BUG: Format mismatch doesn't coerce to NaT,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,24814,pandas EWMA documentation possible error,[],open
5,24813,PERF: Avoid MultiIndex conversion for Interval...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
6,24811,"BUG: Offset-based rolling window, with only on...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,24809,"str.replace('.','') should replace every chara...","[{'id': 57522093, 'node_id': 'MDU6TGFiZWw1NzUy...",open
8,24808,ENH Series.getattr for attributes lacking buil...,[],open
9,24807,simplification of enhancingperf,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
10,24806,DEPR/API: Non-ns precision in Index constructors,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
11,24805,read_csv using C engine and chunksize can grow...,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
12,24804,"str.replace('.','') should replace every chara...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,24800,df.index.map with different size fails for Pan...,"[{'id': 71268330, 'node_id': 'MDU6TGFiZWw3MTI2...",open
14,24798,Assigning values breaks in different ways when...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
15,24794,read_sas column limit,[],open
16,24788,Timestamp.strftime() has erratic behavior afte...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
17,24786,df.groupby(df.index) drops index info when df ...,"[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
18,24784,Locators off by one day,[],open
19,24783,Single-level tuple index to multi-level index ...,[],open
20,24782,BUG: DataFrame.merge(suffixes=) does not respe...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,24779,python-project-packaging-with-pandas,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
22,24778,Python crash with segmentation failure upon im...,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
23,24775,BUG: timedelta64 + Timestamp raises,"[{'id': 47223669, 'node_id': 'MDU6TGFiZWw0NzIy...",open
24,24773,ExtensionArray.astype docstring,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
25,24769,REF/TST: Stop using singleton fixtures,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
26,24768,Concatenating rows with Int64 datatype coerces...,"[{'id': 195647922, 'node_id': 'MDU6TGFiZWwxOTU...",open
27,24767,The feather example from docs segfault with py...,"[{'id': 76865106, 'node_id': 'MDU6TGFiZWw3Njg2...",open
28,24766,read_html ignores paragraphs in table cells,"[{'id': 57395487, 'node_id': 'MDU6TGFiZWw1NzM5...",open
29,24763,Format mismatch doesn't coerce to NaT,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

# 6.4 Interacting with Databases

In [3]:
import sqlite3

In [4]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
 );"""

In [5]:
con = sqlite3.connect('mydata.sqlite')

In [6]:
con.execute(query)

OperationalError: table test already exists

In [7]:
con.commit()

In [8]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [9]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [10]:
con.executemany(stmt, data)

In [11]:
con.commit()

In [12]:
cursor = con.execute('select * from test')

In [13]:
rows = cursor.fetchall()

In [14]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [15]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [16]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [17]:
import sqlalchemy as sqla

In [18]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [19]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

# 6.5 Conclusion

# Joel Rodriguez's questions

### Download the csv file from https://github.com/rodriguezmDNA/pythonproblems (I downloaded the data originally from Keggle but put it on my github for easier access.

### 1. There is something funny about the headers. Use a pandas method to remove redundant data

In [42]:
sfArt = pd.read_csv('pythonproblems-master/sf-civic-art-collection.csv',header=0)

In [43]:
sfArt.head(5)

,_id_,_rev,accession_id,artist,created_at,credit_line,display_dimensions,geometry,location_description,medium,source,title,Location 1
0,_id,_rev,accession_id,artist,NaN,credit_line,display_dimensions,geometry,location_description,medium,source,title,NaN
1,63daabb62278559f8a0643be882613c5,2-2a0d31161230cdd59c47cbf4459ad806,1995.18,"Acconci, Saitowitz and Soloman",1995.0,Commissioned by the San Francisco Art Commissi...,2 1/2 miles X 5 feet,"{""type"":""Point"",""coordinates"":[-122.4120591,37...",Public Display : District 3 : Embarcadero/Wate...,"Black concrete, with a strip of glass blocks, ...",San Francisco Arts Commission,Promenade Ribbon,NaN
2,63daabb62278559f8a0643be88261503,2-8418bc9b09e27aba350721c0de8b98ee,1986.2,"Acconci, Vito",NaN,Purchased by the San Francisco Art Commission ...,"26 1/2"" H X 41"" W","{""type"":""Point"",""coordinates"":[-122.389979,37....",International Airport : T3 : Lower Level,Etching on Paper,San Francisco Arts Commission,Two Wings for Wall and Person,NaN
3,63daabb62278559f8a0643be88261cca,2-673d0a4a69a242adeb9852979da1e295,2002.7,"Acconci, Vito",2002.0,Commission for the San Francisco International...,NaN,"{""type"":""Point"",""coordinates"":[-122.389979,37....","Airport : International Terminal, transfer cor...",mixed medium,San Francisco Arts Commission,Light Beams for the Sky of Transfer Cooridor,NaN
4,63daabb62278559f8a0643be8826291a,2-7ffc3bec57f459d5e478899e0f129bf0,1977.33,"Adams, Gloria Cozzo",1977.0,Purchased by the San Francisco Art Commission ...,481/2,"{""type"":""Point"",""coordinates"":[-122.389979,37....",Airport : Business and Finance,Acrylic and ink on canvas,San Francisco Arts Commission,Cityscape #33,NaN

In [44]:
sfArt = sfArt.drop(0)

In [45]:
sfArt.head(5)

,_id_,_rev,accession_id,artist,created_at,credit_line,display_dimensions,geometry,location_description,medium,source,title,Location 1
1,63daabb62278559f8a0643be882613c5,2-2a0d31161230cdd59c47cbf4459ad806,1995.18,"Acconci, Saitowitz and Soloman",1995.0,Commissioned by the San Francisco Art Commissi...,2 1/2 miles X 5 feet,"{""type"":""Point"",""coordinates"":[-122.4120591,37...",Public Display : District 3 : Embarcadero/Wate...,"Black concrete, with a strip of glass blocks, ...",San Francisco Arts Commission,Promenade Ribbon,NaN
2,63daabb62278559f8a0643be88261503,2-8418bc9b09e27aba350721c0de8b98ee,1986.2,"Acconci, Vito",NaN,Purchased by the San Francisco Art Commission ...,"26 1/2"" H X 41"" W","{""type"":""Point"",""coordinates"":[-122.389979,37....",International Airport : T3 : Lower Level,Etching on Paper,San Francisco Arts Commission,Two Wings for Wall and Person,NaN
3,63daabb62278559f8a0643be88261cca,2-673d0a4a69a242adeb9852979da1e295,2002.7,"Acconci, Vito",2002.0,Commission for the San Francisco International...,NaN,"{""type"":""Point"",""coordinates"":[-122.389979,37....","Airport : International Terminal, transfer cor...",mixed medium,San Francisco Arts Commission,Light Beams for the Sky of Transfer Cooridor,NaN
4,63daabb62278559f8a0643be8826291a,2-7ffc3bec57f459d5e478899e0f129bf0,1977.33,"Adams, Gloria Cozzo",1977.0,Purchased by the San Francisco Art Commission ...,481/2,"{""type"":""Point"",""coordinates"":[-122.389979,37....",Airport : Business and Finance,Acrylic and ink on canvas,San Francisco Arts Commission,Cityscape #33,NaN
5,63daabb62278559f8a0643be88262f39,2-b62dd5bf7e5f6b7e8a62cd78a216d052,1985.5.3,"Adams, Mark",1982.0,Purchased by the San Francisco Art Commission ...,"84"" H X 144"" W","{""type"":""Point"",""coordinates"":[-122.389979,37....",Airport : Terminal 2 : Meeting Area,Flat weave wool tapestry,San Francisco Arts Commission,Garden Outside the Gate (The Garden Tapestries),NaN

### 2. Which artist is the most frequent found in the collection, and how many paintings are there?

In [47]:
artist_collections = sfArt['artist']
artist_collections.value_counts()

deSoto, Lewis                                21
Joesam.                                      20
Bufano, Beniamino                            18
Smith, Owen                                  17
Huang, Arlan                                 16
Hoff, Terry                                  15
Brothers, Beliz                              14
Fletcher, Harrell and Rubin, John            14
Piazzoni, Gottardo Fidele Ponziano           13
Igarashi, Takenobu                           11
Chamberlain, Ann and Lubell, Bernie          11
Fuller (Mcchesney), Mary                     11
Goggin, Brian                                10
Cummings, M. Earl                            10
Patigian, Haig                                9
Garza, Carmen Lomas                           9
Hall, Diane Andrews                           8
Brangwyn, Frank                               8
Riley, Cheryl                                 7
Reid, Robert                                  7
Anonymous                                     7
Tilden, Douglas                               6
Aitken, Robert Ingersoll                      4
Stackpole, Ralph                              4
Barr, Aileen                                  4
Potts, Don                                    4
Diebenkorn, Richard                           4
Asawa, Ruth                                   3
Bongers, Jaap (Jacob)                         3
Cravath, Ruth Wakefield                       3
                                             ..
Shields-Clarke, Thomas                        1
Shum, Hilda                                   1
Roberts, Kent                                 1
Di Colbertaldo, Vittorio                      1
Barnes, Carroll                               1
Paunov, Zlatko                                1
Crumpler, Dewey                               1
Kirkland, Larry                               1
Biaggi, Suzanne                               1
Rebar Group                                   1
Gilliam, Sam                                  1
Stern, Jan Peter                              1
Alicia/Montoya, Juana/Emmanuel                1
Hudson, Robert                                1
Marsh, Thomas                                 1
Qizhan, Zhu                                   1
Story, William Wetmore                        1
Mora, Joseph Jacinto                          1
Parhad, Fred                                  1
Perry, Charles O.                             1
Yung, Rene                                    1
Rios, Michael                                 1
Grafly, Charles                               1
Zakheim, Bernard Baruch                       1
Perry, R. Hinton                              1
Wehrle, John                                  1
Lerner, Leslie                                1
Richards, Peter and Schwartzenberg, Susan     1
Hall, Parker                                  1
Choi, Man Lin                                 1
Name: artist, Length: 358, dtype: int64

In [48]:
sfArt.artist.value_counts().head(1)

deSoto, Lewis    21
Name: artist, dtype: int64

### 3.From this artist, what are the names and dates of his works?

In [49]:
freqArtist = sfArt.artist.value_counts().head(1).index[0]
sfArt[sfArt.artist == freqArtist][["created_at","title"]]

     created_at                                              title
174         NaN  1994: Staff and Residentes Celebrate the Reded...
175         NaN  1974-1977: Gerald Simon Theater Entertains the...
176      2000.0                                         On The Air
177         NaN    1949-1958: Community Activities at Laguna Honda
178         NaN  1999: Proposition A for the Laguna Honda Proje...
179         NaN          1947-1954: University of California . . .
180         NaN  1990-2000: Volunteers Contribute to Life at La...
181      2006.0          Shining Paths,San Francisco Sister Cities
182      1997.0                                 Jury Assembly Room
183         NaN                                              Woven
184         NaN  1929-1941: Patient Care During the Great Depre...
185         NaN  1909: President Theodore Roosevelt Visits the ...
186         NaN           1908: The Construction of Clarendon Hall
187         NaN  1926: Mayor James Rolf, Jr. Dedicates the Lagu...
188         NaN  1947-1954: University of California, San Franc...
189         NaN  1929-1941: Patient Care During the Great Depre...
190         NaN    1949-1958: Community Activities at Laguna Honda
191         NaN  1865-1906: The Foundation of the Almshouse and...
192         NaN  1934-1954-1982: Glen Wessel's Murals are Creat...
193         NaN           1908: The Construction of Clarendon Hall
194         NaN     1954-1997: Virginia Leishman, Nursing Director

# My Question 6-2

In [2]:
import requests